In [21]:
import pandas as pd
import seaborn as sns

In [22]:
# Load Titanic dataset from seaborn
df = sns.load_dataset('titanic')

In [23]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
df.shape

(891, 15)

In [25]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [26]:
# Drop rows with missing Age values
df = df.dropna(subset=['age'])

In [27]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           530
embark_town      2
alive            0
alone            0
dtype: int64

In [28]:
df.shape

(714, 15)

In [29]:
# Group by 'sex' and calculate summary statistics for 'age'
summary_stats = df.groupby('sex')['age'].agg(['mean', 'median', 'min', 'max', 'std'])
summary_stats

             mean  median   min   max        std
sex
female  27.915709    27.0  0.75  63.0  14.110146
male    30.726645    29.0  0.42  80.0  14.678201

In [30]:
age_grouped = df.groupby('sex')['age'].apply(list)
age_grouped

sex
female    [38.0, 26.0, 35.0, 27.0, 14.0, 4.0, 58.0, 14.0...
male      [22.0, 35.0, 54.0, 2.0, 20.0, 39.0, 2.0, 35.0,...
Name: age, dtype: object

In [31]:
import pandas as pd
from sklearn import datasets
# Load the iris dataset
# url = "https://raw.githubusercontent.com/uiuc-cse/data-fa14/gh-pages/data/iris.csv"
# df = pd.read_csv(url)

iris = datasets.load_iris()
data = pd.DataFrame(data=iris.data, columns=iris.feature_names)
data['species'] = pd.Categorical.from_codes(iris.target, iris.target_names)

In [32]:
data.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [34]:
# Group by species and describe
for col in data.columns:
    if(col != "species"):
        print(f"--------< {col} >--------")
        print(data.groupby("species")[col].agg(['mean', 'median', 'min', 'max', 'std']),"\n")

# for col in df.columns:
#     if(col != "species"):
#         print(f"<-----------{col}----------->")
#         print(species_group[col].agg(["mean", "median", "std", "min", "max"]))
#         print('\n')

--------< sepal length (cm) >--------
             mean  median  min  max       std
species
setosa      5.006     5.0  4.3  5.8  0.352490
versicolor  5.936     5.9  4.9  7.0  0.516171
virginica   6.588     6.5  4.9  7.9  0.635880

--------< sepal width (cm) >--------
             mean  median  min  max       std
species
setosa      3.428     3.4  2.3  4.4  0.379064
versicolor  2.770     2.8  2.0  3.4  0.313798
virginica   2.974     3.0  2.2  3.8  0.322497

--------< petal length (cm) >--------
             mean  median  min  max       std
species
setosa      1.462    1.50  1.0  1.9  0.173664
versicolor  4.260    4.35  3.0  5.1  0.469911
virginica   5.552    5.55  4.5  6.9  0.551895

--------< petal width (cm) >--------
             mean  median  min  max       std
species
setosa      0.246     0.2  0.1  0.6  0.105386
versicolor  1.326     1.3  1.0  1.8  0.197753
virginica   2.026     2.0  1.4  2.5  0.274650

C:\Users\dhans\AppData\Local\Temp\ipykernel_18720\319218814.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby("species")[col].agg(['mean', 'median', 'min', 'max', 'std']),"\n")
C:\Users\dhans\AppData\Local\Temp\ipykernel_18720\319218814.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby("species")[col].agg(['mean', 'median', 'min', 'max', 'std']),"\n")
C:\Users\dhans\AppData\Local\Temp\ipykernel_18720\319218814.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby("species")[col].agg(['mean', 'median', 'min', 'max', 'std']),"\n")
C:\Users\dhans\AppData\Local\Temp\ipykernel_18720\319218814.py:5: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  print(data.groupby("species")[col].agg(['mean', 'median', 'min', 'max', 'std']),"\n")